tutorials/cases/canonical/conservation/radiationReservoir/0.orig/G
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    // Perfectly reflecting: snGrad(G) is zero, so qr is zero on every face and
    // the reservoir cannot balance itself through the boundary.
    wall
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
