tutorials/cases/canonical/conservation/radiationReservoir/0.orig/porosityF
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      porosityF;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

// Three cells well below criticalPorosity (0.9999) and one just above it.
// The fourth is still solid to radiatingCellHasSolid - 0.99991 < 1 - 1e-8 - so the old
// ungated producer emitted from it while TEqn booked nothing.
internalField   nonuniform List<scalar> 4 (0.5 0.5 0.5 0.99991);

boundaryField
{
    wall
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
